<template>
  <section class="line">
    <div class="line-inner">
      <div class="line-tit">
        <marquee behavior="" direction="left" loop="infinite">
          <div class="markQUEE">
            <p>
              <span>🚀 Սարքավորումների լայն տեսականի </span>Սմարթֆոններից և
              դյուրակիր համակարգիչներից մինչև տնային էլեկտրոնային գաջեթներ, մենք
              ունենք ամեն ինչ ձեր կյանքն ավելի հարմարավետ և ոճային դարձնելու
              համար: Մենք առաջարկում ենք լավագույն ապրանքանիշերը մատչելի գներով:
            </p>
            <p>
              <span>🔒 Ապահով գնումներ և երաշխավորված որակ </span>Ձեր գնումների
              անվտանգությունը մեր առաջնահերթությունն է: Մենք երաշխավորում ենք
              բարձրորակ ապրանքներ և տրամադրում ենք վճարման հուսալի եղանակներ:
              Ձեր վստահությունը մեր հանդեպ մեր հպարտությունն է:
            </p>
            <p>
              <span>🌟 Հատուկ առաջարկ Ձեզ համար </span>Օգտագործեք SINS2005 եզակի
              գովազդային կոդը և ստացեք բացառիկ զեղչ մեր առցանց սարքավորումների
              խանութում:
            </p>
          </div>
        </marquee>
      </div>
    </div>
  </section>
</template>
<script>
//
</script>
<style scoped lang="scss">
.line {
  width: 100%;
  padding: 15px 0;
  background-color: #263c97;
  color: white;

  .line-inner {
    width: 100%;
    padding: 0 5px;
    .line-tit {
      max-width: 100%;
      margin: 0 auto;
      display: flex;
      flex-direction: row;

      .markQUEE {
        display: flex;

        p {
          margin: 0 100px;
        }
      }

      span {
        font-weight: bold;
        letter-spacing: 1px;
      }
    }
  }
}
</style>
